In [1]:
import seaborn as sbs 

df=sbs.load_dataset('titanic')

print(df['age'].isnull().sum())
df["age_mean"] = df["age"].fillna(df['age'].mean())
df["age_median"] = df["age"].fillna(df['age'].median())
print("---",df["age"].isnull().sum())
print("---",df["age_median"].isnull().sum())


print(df[['age','age_mean','age_median']])

177
--- 177
--- 0
      age   age_mean  age_median
0    22.0  22.000000        22.0
1    38.0  38.000000        38.0
2    26.0  26.000000        26.0
3    35.0  35.000000        35.0
4    35.0  35.000000        35.0
..    ...        ...         ...
886  27.0  27.000000        27.0
887  19.0  19.000000        19.0
888   NaN  29.699118        28.0
889  26.0  26.000000        26.0
890  32.0  32.000000        32.0

[891 rows x 3 columns]

In [ ]:
df["age_median"]=df['age'].fillna(df["age"].median())
print(df[['age','age_median']])

print(df['embarked'].unique())
print(df['embarked'].isnull().sum())

df['new_embarked']=df['embarked'].fillna(df['embarked'].mode())

print(df['new_embarked'].unique())
print(df['new_embarked'].isnull().sum())

['S' 'C' 'Q' nan]
2
['S' 'C' 'Q' nan]
2

In [2]:
print(df['embarked'].unique())

df[df['embarked'].isnull()]
print(df['embarked'].isnull().sum())
print(df[df['embarked'].notna()]['embarked'].mode()[0])

mode_value=df[df['embarked'].notna()]['embarked'].mode()[0]
df['embarked_mode']=df['embarked'].fillna(mode_value)
df[['embarked_mode','embarked']]

['S' 'C' 'Q' nan]
2
S

    embarked_mode embarked
0               S        S
1               C        C
2               S        S
3               S        S
4               S        S
..            ...      ...
886             S        S
887             S        S
888             S        S
889             C        C
890             Q        Q

[891 rows x 2 columns]